import asyncio
from telegram import Bot
from datetime import datetime, date
import os
import random

# Получаем токен и chat_id из GitHub Secrets
TOKEN = os.environ["TOKEN"]
CHAT_ID = int(os.environ["CHAT_ID"])

# Дата окончания абонемента
end_subscription = date(2026, 1, 29)
days_left = (end_subscription - date.today()).days
if days_left < 0:
    days_left = 0

# Текущая дата
today = datetime.now().strftime("%d.%m.%Y")

# Список мотивационных фраз
phrases = [
    "Не сдавайся и двигайся к цели!",
    "Помни, каждый день — шаг к успеху!",
    "Давай, сегодня твой день в зале!",
    "Это отличный день, чтобы пойти в спортзал и начать меняться к лучшему!",
    "Сегодня именно этот день! Действуй",
    "Лучше поздно, чем никогда",
    "Ты уже на пол пути к большим изминениям, действуй!",
    "Мы все верим в тебя — осталось только пойти и сделать!",
	"Каждый пропущенный день — минус шаг к цели, не сегодня!",
    "Сегодня не «когда-нибудь», сегодня — тот самый день",
	"Слабость — временная, результат — надолго. Вперёд!",
	"Спортивный зал не кусается, а вот прогресс — очень приятный",
	"Абонемент ждёт, мышцы скучают, пора исправлять ситуацию",
	"Лучшее время начать — прямо сейчас. Не откладывай!",
	"Ты сильнее, чем думаешь. Проверь это сегодня",
	"Минуты в зале сегодня = уверенность завтра. Действуй!"
]

# Список эмодзи для украшения
emojis = ["💪", "🔥", "🏋️‍♂️", "⚡", "🏃‍♂️"]

# Выбираем случайную фразу и эмодзи
phrase = random.choice(phrases)
emoji = random.choice(emojis)

# Формируем сообщение
message = f"Валентин, сегодня уже {today}! \n{phrase} {emoji} \nДо окончания активации абонемента осталось всего {days_left} дней."

async def send_message():
    async with Bot(token=TOKEN) as bot:
        await bot.send_message(chat_id=CHAT_ID, text=message)
        print("Сообщение отправлено:", message)

async def main():
    print("Бот запущен. Через 3 секунды отправится сообщение...")
    await asyncio.sleep(3)
    await send_message()

if __name__ == "__main__":
    asyncio.run(main())
